espressif/esp-idf/components/soc/esp32p4/register/hw_ver3/soc/lp_spi_reg.h
/** LP_SPI_DMA_INT_ENA_REG register
 *  SPI DMA interrupt enable register
 */
#define LP_SPI_DMA_INT_ENA_REG (DR_REG_LP_BASE + 0x34)
/** LP_REG_SLV_RD_BUF_DONE_INT_ENA : R/W; bitpos: [10]; default: 0;
 *  The enable bit for SPI_SLV_RD_BUF_DONE_INT interrupt.
 */
#define LP_REG_SLV_RD_BUF_DONE_INT_ENA    (BIT(10))
#define LP_REG_SLV_RD_BUF_DONE_INT_ENA_M  (LP_REG_SLV_RD_BUF_DONE_INT_ENA_V << LP_REG_SLV_RD_BUF_DONE_INT_ENA_S)
#define LP_REG_SLV_RD_BUF_DONE_INT_ENA_V  0x00000001U
#define LP_REG_SLV_RD_BUF_DONE_INT_ENA_S  10
/** LP_REG_SLV_WR_BUF_DONE_INT_ENA : R/W; bitpos: [11]; default: 0;
 *  The enable bit for SPI_SLV_WR_BUF_DONE_INT interrupt.
 */
#define LP_REG_SLV_WR_BUF_DONE_INT_ENA    (BIT(11))
#define LP_REG_SLV_WR_BUF_DONE_INT_ENA_M  (LP_REG_SLV_WR_BUF_DONE_INT_ENA_V << LP_REG_SLV_WR_BUF_DONE_INT_ENA_S)
#define LP_REG_SLV_WR_BUF_DONE_INT_ENA_V  0x00000001U
#define LP_REG_SLV_WR_BUF_DONE_INT_ENA_S  11
/** LP_REG_TRANS_DONE_INT_ENA : R/W; bitpos: [12]; default: 0;
 *  The enable bit for SPI_TRANS_DONE_INT interrupt.
 */
#define LP_REG_TRANS_DONE_INT_ENA    (BIT(12))
#define LP_REG_TRANS_DONE_INT_ENA_M  (LP_REG_TRANS_DONE_INT_ENA_V << LP_REG_TRANS_DONE_INT_ENA_S)
#define LP_REG_TRANS_DONE_INT_ENA_V  0x00000001U
#define LP_REG_TRANS_DONE_INT_ENA_S  12
/** LP_REG_SPI_WAKEUP_INT_ENA : R/W; bitpos: [14]; default: 0;
 *  The enable bit for SPI_WAKEUP_INT interrupt
 */
#define LP_REG_SPI_WAKEUP_INT_ENA    (BIT(14))
#define LP_REG_SPI_WAKEUP_INT_ENA_M  (LP_REG_SPI_WAKEUP_INT_ENA_V << LP_REG_SPI_WAKEUP_INT_ENA_S)
#define LP_REG_SPI_WAKEUP_INT_ENA_V  0x00000001U
#define LP_REG_SPI_WAKEUP_INT_ENA_S  14
/** LP_REG_SLV_BUF_ADDR_ERR_INT_ENA : R/W; bitpos: [15]; default: 0;
 *  The enable bit for SPI_SLV_BUF_ADDR_ERR_INT interrupt.
 */
#define LP_REG_SLV_BUF_ADDR_ERR_INT_ENA    (BIT(15))
#define LP_REG_SLV_BUF_ADDR_ERR_INT_ENA_M  (LP_REG_SLV_BUF_ADDR_ERR_INT_ENA_V << LP_REG_SLV_BUF_ADDR_ERR_INT_ENA_S)
#define LP_REG_SLV_BUF_ADDR_ERR_INT_ENA_V  0x00000001U
#define LP_REG_SLV_BUF_ADDR_ERR_INT_ENA_S  15
/** LP_REG_SLV_CMD_ERR_INT_ENA : R/W; bitpos: [16]; default: 0;
 *  The enable bit for SPI_SLV_CMD_ERR_INT interrupt.
 */
#define LP_REG_SLV_CMD_ERR_INT_ENA    (BIT(16))
#define LP_REG_SLV_CMD_ERR_INT_ENA_M  (LP_REG_SLV_CMD_ERR_INT_ENA_V << LP_REG_SLV_CMD_ERR_INT_ENA_S)
#define LP_REG_SLV_CMD_ERR_INT_ENA_V  0x00000001U
#define LP_REG_SLV_CMD_ERR_INT_ENA_S  16
/** LP_REG_MST_RX_AFIFO_WFULL_ERR_INT_ENA : R/W; bitpos: [17]; default: 0;
 *  The enable bit for SPI_MST_RX_AFIFO_WFULL_ERR_INT interrupt.
 */
#define LP_REG_MST_RX_AFIFO_WFULL_ERR_INT_ENA    (BIT(17))
#define LP_REG_MST_RX_AFIFO_WFULL_ERR_INT_ENA_M  (LP_REG_MST_RX_AFIFO_WFULL_ERR_INT_ENA_V << LP_REG_MST_RX_AFIFO_WFULL_ERR_INT_ENA_S)
#define LP_REG_MST_RX_AFIFO_WFULL_ERR_INT_ENA_V  0x00000001U
#define LP_REG_MST_RX_AFIFO_WFULL_ERR_INT_ENA_S  17
/** LP_REG_MST_TX_AFIFO_REMPTY_ERR_INT_ENA : R/W; bitpos: [18]; default: 0;
 *  The enable bit for SPI_MST_TX_AFIFO_REMPTY_ERR_INT interrupt.
 */
#define LP_REG_MST_TX_AFIFO_REMPTY_ERR_INT_ENA    (BIT(18))
#define LP_REG_MST_TX_AFIFO_REMPTY_ERR_INT_ENA_M  (LP_REG_MST_TX_AFIFO_REMPTY_ERR_INT_ENA_V << LP_REG_MST_TX_AFIFO_REMPTY_ERR_INT_ENA_S)
#define LP_REG_MST_TX_AFIFO_REMPTY_ERR_INT_ENA_V  0x00000001U
#define LP_REG_MST_TX_AFIFO_REMPTY_ERR_INT_ENA_S  18
/** LP_REG_APP2_INT_ENA : R/W; bitpos: [19]; default: 0;
 *  The enable bit for SPI_APP2_INT interrupt.
 */
#define LP_REG_APP2_INT_ENA    (BIT(19))
#define LP_REG_APP2_INT_ENA_M  (LP_REG_APP2_INT_ENA_V << LP_REG_APP2_INT_ENA_S)
#define LP_REG_APP2_INT_ENA_V  0x00000001U
#define LP_REG_APP2_INT_ENA_S  19
/** LP_REG_APP1_INT_ENA : R/W; bitpos: [20]; default: 0;
 *  The enable bit for SPI_APP1_INT interrupt.
 */
#define LP_REG_APP1_INT_ENA    (BIT(20))
#define LP_REG_APP1_INT_ENA_M  (LP_REG_APP1_INT_ENA_V << LP_REG_APP1_INT_ENA_S)
#define LP_REG_APP1_INT_ENA_V  0x00000001U
#define LP_REG_APP1_INT_ENA_S  20

/** LP_SPI_DMA_INT_CLR_REG register
 *  SPI DMA interrupt clear register
 */
#define LP_SPI_DMA_INT_CLR_REG (DR_REG_LP_BASE + 0x38)
/** LP_REG_SLV_RD_BUF_DONE_INT_CLR : WT; bitpos: [10]; default: 0;
 *  The clear bit for SPI_SLV_RD_BUF_DONE_INT interrupt.
 */
#define LP_REG_SLV_RD_BUF_DONE_INT_CLR    (BIT(10))
#define LP_REG_SLV_RD_BUF_DONE_INT_CLR_M  (LP_REG_SLV_RD_BUF_DONE_INT_CLR_V << LP_REG_SLV_RD_BUF_DONE_INT_CLR_S)
#define LP_REG_SLV_RD_BUF_DONE_INT_CLR_V  0x00000001U
#define LP_REG_SLV_RD_BUF_DONE_INT_CLR_S  10
/** LP_REG_SLV_WR_BUF_DONE_INT_CLR : WT; bitpos: [11]; default: 0;
 *  The clear bit for SPI_SLV_WR_BUF_DONE_INT interrupt.
 */
#define LP_REG_SLV_WR_BUF_DONE_INT_CLR    (BIT(11))
#define LP_REG_SLV_WR_BUF_DONE_INT_CLR_M  (LP_REG_SLV_WR_BUF_DONE_INT_CLR_V << LP_REG_SLV_WR_BUF_DONE_INT_CLR_S)
#define LP_REG_SLV_WR_BUF_DONE_INT_CLR_V  0x00000001U
#define LP_REG_SLV_WR_BUF_DONE_INT_CLR_S  11
/** LP_REG_TRANS_DONE_INT_CLR : WT; bitpos: [12]; default: 0;
 *  The clear bit for SPI_TRANS_DONE_INT interrupt.
 */
#define LP_REG_TRANS_DONE_INT_CLR    (BIT(12))
#define LP_REG_TRANS_DONE_INT_CLR_M  (LP_REG_TRANS_DONE_INT_CLR_V << LP_REG_TRANS_DONE_INT_CLR_S)
#define LP_REG_TRANS_DONE_INT_CLR_V  0x00000001U
#define LP_REG_TRANS_DONE_INT_CLR_S  12
/** LP_REG_SPI_WAKEUP_INT_CLR : WT; bitpos: [14]; default: 0;
 *  The clear bit for SPI_WAKEUP_INT interrupt
 */
#define LP_REG_SPI_WAKEUP_INT_CLR    (BIT(14))
#define LP_REG_SPI_WAKEUP_INT_CLR_M  (LP_REG_SPI_WAKEUP_INT_CLR_V << LP_REG_SPI_WAKEUP_INT_CLR_S)
#define LP_REG_SPI_WAKEUP_INT_CLR_V  0x00000001U
#define LP_REG_SPI_WAKEUP_INT_CLR_S  14
/** LP_REG_SLV_BUF_ADDR_ERR_INT_CLR : WT; bitpos: [15]; default: 0;
 *  The clear bit for SPI_SLV_BUF_ADDR_ERR_INT interrupt.
 */
#define LP_REG_SLV_BUF_ADDR_ERR_INT_CLR    (BIT(15))
#define LP_REG_SLV_BUF_ADDR_ERR_INT_CLR_M  (LP_REG_SLV_BUF_ADDR_ERR_INT_CLR_V << LP_REG_SLV_BUF_ADDR_ERR_INT_CLR_S)
#define LP_REG_SLV_BUF_ADDR_ERR_INT_CLR_V  0x00000001U
#define LP_REG_SLV_BUF_ADDR_ERR_INT_CLR_S  15
/** LP_REG_SLV_CMD_ERR_INT_CLR : WT; bitpos: [16]; default: 0;
 *  The clear bit for SPI_SLV_CMD_ERR_INT interrupt.
 */
#define LP_REG_SLV_CMD_ERR_INT_CLR    (BIT(16))
#define LP_REG_SLV_CMD_ERR_INT_CLR_M  (LP_REG_SLV_CMD_ERR_INT_CLR_V << LP_REG_SLV_CMD_ERR_INT_CLR_S)
#define LP_REG_SLV_CMD_ERR_INT_CLR_V  0x00000001U
#define LP_REG_SLV_CMD_ERR_INT_CLR_S  16
/** LP_REG_MST_RX_AFIFO_WFULL_ERR_INT_CLR : WT; bitpos: [17]; default: 0;
 *  The clear bit for SPI_MST_RX_AFIFO_WFULL_ERR_INT interrupt.
 */
#define LP_REG_MST_RX_AFIFO_WFULL_ERR_INT_CLR    (BIT(17))
#define LP_REG_MST_RX_AFIFO_WFULL_ERR_INT_CLR_M  (LP_REG_MST_RX_AFIFO_WFULL_ERR_INT_CLR_V << LP_REG_MST_RX_AFIFO_WFULL_ERR_INT_CLR_S)
#define LP_REG_MST_RX_AFIFO_WFULL_ERR_INT_CLR_V  0x00000001U
#define LP_REG_MST_RX_AFIFO_WFULL_ERR_INT_CLR_S  17
/** LP_REG_MST_TX_AFIFO_REMPTY_ERR_INT_CLR : WT; bitpos: [18]; default: 0;
 *  The clear bit for SPI_MST_TX_AFIFO_REMPTY_ERR_INT interrupt.
 */
#define LP_REG_MST_TX_AFIFO_REMPTY_ERR_INT_CLR    (BIT(18))
#define LP_REG_MST_TX_AFIFO_REMPTY_ERR_INT_CLR_M  (LP_REG_MST_TX_AFIFO_REMPTY_ERR_INT_CLR_V << LP_REG_MST_TX_AFIFO_REMPTY_ERR_INT_CLR_S)
#define LP_REG_MST_TX_AFIFO_REMPTY_ERR_INT_CLR_V  0x00000001U
#define LP_REG_MST_TX_AFIFO_REMPTY_ERR_INT_CLR_S  18
/** LP_REG_APP2_INT_CLR : WT; bitpos: [19]; default: 0;
 *  The clear bit for SPI_APP2_INT interrupt.
 */
#define LP_REG_APP2_INT_CLR    (BIT(19))
#define LP_REG_APP2_INT_CLR_M  (LP_REG_APP2_INT_CLR_V << LP_REG_APP2_INT_CLR_S)
#define LP_REG_APP2_INT_CLR_V  0x00000001U
#define LP_REG_APP2_INT_CLR_S  19
/** LP_REG_APP1_INT_CLR : WT; bitpos: [20]; default: 0;
 *  The clear bit for SPI_APP1_INT interrupt.
 */
#define LP_REG_APP1_INT_CLR    (BIT(20))
#define LP_REG_APP1_INT_CLR_M  (LP_REG_APP1_INT_CLR_V << LP_REG_APP1_INT_CLR_S)
#define LP_REG_APP1_INT_CLR_V  0x00000001U
#define LP_REG_APP1_INT_CLR_S  20

