espressif/esp-idf/components/soc/esp32p4/register/hw_ver3/soc/lp_spi_reg.h
/** LP_SPI_SLEEP_CONF1_REG register
 *  NA
 */
#define LP_SPI_SLEEP_CONF1_REG (DR_REG_LP_BASE + 0x48)
/** LP_REG_SLV_WK_CHAR1 : R/W; bitpos: [7:0]; default: 11;
 *  NA
 */
#define LP_REG_SLV_WK_CHAR1    0x000000FFU
#define LP_REG_SLV_WK_CHAR1_M  (LP_REG_SLV_WK_CHAR1_V << LP_REG_SLV_WK_CHAR1_S)
#define LP_REG_SLV_WK_CHAR1_V  0x000000FFU
#define LP_REG_SLV_WK_CHAR1_S  0
/** LP_REG_SLV_WK_CHAR2 : R/W; bitpos: [15:8]; default: 12;
 *  NA
 */
#define LP_REG_SLV_WK_CHAR2    0x000000FFU
#define LP_REG_SLV_WK_CHAR2_M  (LP_REG_SLV_WK_CHAR2_V << LP_REG_SLV_WK_CHAR2_S)
#define LP_REG_SLV_WK_CHAR2_V  0x000000FFU
#define LP_REG_SLV_WK_CHAR2_S  8
/** LP_REG_SLV_WK_CHAR3 : R/W; bitpos: [23:16]; default: 13;
 *  NA
 */
#define LP_REG_SLV_WK_CHAR3    0x000000FFU
#define LP_REG_SLV_WK_CHAR3_M  (LP_REG_SLV_WK_CHAR3_V << LP_REG_SLV_WK_CHAR3_S)
#define LP_REG_SLV_WK_CHAR3_V  0x000000FFU
#define LP_REG_SLV_WK_CHAR3_S  16
/** LP_REG_SLV_WK_CHAR4 : R/W; bitpos: [31:24]; default: 14;
 *  NA
 */
#define LP_REG_SLV_WK_CHAR4    0x000000FFU
#define LP_REG_SLV_WK_CHAR4_M  (LP_REG_SLV_WK_CHAR4_V << LP_REG_SLV_WK_CHAR4_S)
#define LP_REG_SLV_WK_CHAR4_V  0x000000FFU
#define LP_REG_SLV_WK_CHAR4_S  24

/** LP_SPI_DMA_INT_SET_REG register
 *  SPI interrupt software set register
 */
#define LP_SPI_DMA_INT_SET_REG (DR_REG_LP_BASE + 0x4c)
/** LP_SPI_SLV_RD_BUF_DONE_INT_SET : WT; bitpos: [10]; default: 0;
 *  The software set bit for SPI_SLV_RD_BUF_DONE_INT interrupt.
 */
#define LP_SPI_SLV_RD_BUF_DONE_INT_SET    (BIT(10))
#define LP_SPI_SLV_RD_BUF_DONE_INT_SET_M  (LP_SPI_SLV_RD_BUF_DONE_INT_SET_V << LP_SPI_SLV_RD_BUF_DONE_INT_SET_S)
#define LP_SPI_SLV_RD_BUF_DONE_INT_SET_V  0x00000001U
#define LP_SPI_SLV_RD_BUF_DONE_INT_SET_S  10
/** LP_SPI_SLV_WR_BUF_DONE_INT_SET : WT; bitpos: [11]; default: 0;
 *  The software set bit for SPI_SLV_WR_BUF_DONE_INT interrupt.
 */
#define LP_SPI_SLV_WR_BUF_DONE_INT_SET    (BIT(11))
#define LP_SPI_SLV_WR_BUF_DONE_INT_SET_M  (LP_SPI_SLV_WR_BUF_DONE_INT_SET_V << LP_SPI_SLV_WR_BUF_DONE_INT_SET_S)
#define LP_SPI_SLV_WR_BUF_DONE_INT_SET_V  0x00000001U
#define LP_SPI_SLV_WR_BUF_DONE_INT_SET_S  11
/** LP_SPI_TRANS_DONE_INT_SET : WT; bitpos: [12]; default: 0;
 *  The software set bit for SPI_TRANS_DONE_INT interrupt.
 */
#define LP_SPI_TRANS_DONE_INT_SET    (BIT(12))
#define LP_SPI_TRANS_DONE_INT_SET_M  (LP_SPI_TRANS_DONE_INT_SET_V << LP_SPI_TRANS_DONE_INT_SET_S)
#define LP_SPI_TRANS_DONE_INT_SET_V  0x00000001U
#define LP_SPI_TRANS_DONE_INT_SET_S  12
/** LP_SPI_SLV_BUF_ADDR_ERR_INT_SET : WT; bitpos: [15]; default: 0;
 *  The software set bit for SPI_SLV_BUF_ADDR_ERR_INT interrupt.
 */
#define LP_SPI_SLV_BUF_ADDR_ERR_INT_SET    (BIT(15))
#define LP_SPI_SLV_BUF_ADDR_ERR_INT_SET_M  (LP_SPI_SLV_BUF_ADDR_ERR_INT_SET_V << LP_SPI_SLV_BUF_ADDR_ERR_INT_SET_S)
#define LP_SPI_SLV_BUF_ADDR_ERR_INT_SET_V  0x00000001U
#define LP_SPI_SLV_BUF_ADDR_ERR_INT_SET_S  15
/** LP_SPI_SLV_CMD_ERR_INT_SET : WT; bitpos: [16]; default: 0;
 *  The software set bit for SPI_SLV_CMD_ERR_INT interrupt.
 */
#define LP_SPI_SLV_CMD_ERR_INT_SET    (BIT(16))
#define LP_SPI_SLV_CMD_ERR_INT_SET_M  (LP_SPI_SLV_CMD_ERR_INT_SET_V << LP_SPI_SLV_CMD_ERR_INT_SET_S)
#define LP_SPI_SLV_CMD_ERR_INT_SET_V  0x00000001U
#define LP_SPI_SLV_CMD_ERR_INT_SET_S  16
/** LP_SPI_MST_RX_AFIFO_WFULL_ERR_INT_SET : WT; bitpos: [17]; default: 0;
 *  The software set bit for SPI_MST_RX_AFIFO_WFULL_ERR_INT interrupt.
 */
#define LP_SPI_MST_RX_AFIFO_WFULL_ERR_INT_SET    (BIT(17))
#define LP_SPI_MST_RX_AFIFO_WFULL_ERR_INT_SET_M  (LP_SPI_MST_RX_AFIFO_WFULL_ERR_INT_SET_V << LP_SPI_MST_RX_AFIFO_WFULL_ERR_INT_SET_S)
#define LP_SPI_MST_RX_AFIFO_WFULL_ERR_INT_SET_V  0x00000001U
#define LP_SPI_MST_RX_AFIFO_WFULL_ERR_INT_SET_S  17
/** LP_SPI_MST_TX_AFIFO_REMPTY_ERR_INT_SET : WT; bitpos: [18]; default: 0;
 *  The software set bit for SPI_MST_TX_AFIFO_REMPTY_ERR_INT interrupt.
 */
#define LP_SPI_MST_TX_AFIFO_REMPTY_ERR_INT_SET    (BIT(18))
#define LP_SPI_MST_TX_AFIFO_REMPTY_ERR_INT_SET_M  (LP_SPI_MST_TX_AFIFO_REMPTY_ERR_INT_SET_V << LP_SPI_MST_TX_AFIFO_REMPTY_ERR_INT_SET_S)
#define LP_SPI_MST_TX_AFIFO_REMPTY_ERR_INT_SET_V  0x00000001U
#define LP_SPI_MST_TX_AFIFO_REMPTY_ERR_INT_SET_S  18
/** LP_SPI_APP2_INT_SET : WT; bitpos: [19]; default: 0;
 *  The software set bit for SPI_APP2_INT interrupt.
 */
#define LP_SPI_APP2_INT_SET    (BIT(19))
#define LP_SPI_APP2_INT_SET_M  (LP_SPI_APP2_INT_SET_V << LP_SPI_APP2_INT_SET_S)
#define LP_SPI_APP2_INT_SET_V  0x00000001U
#define LP_SPI_APP2_INT_SET_S  19
/** LP_SPI_APP1_INT_SET : WT; bitpos: [20]; default: 0;
 *  The software set bit for SPI_APP1_INT interrupt.
 */
#define LP_SPI_APP1_INT_SET    (BIT(20))
#define LP_SPI_APP1_INT_SET_M  (LP_SPI_APP1_INT_SET_V << LP_SPI_APP1_INT_SET_S)
#define LP_SPI_APP1_INT_SET_V  0x00000001U
#define LP_SPI_APP1_INT_SET_S  20

/** LP_SPI_W0_REG register
 *  SPI CPU-controlled buffer0
 */
#define LP_SPI_W0_REG (DR_REG_LP_BASE + 0x98)
/** LP_REG_BUF0 : R/W/SS; bitpos: [31:0]; default: 0;
 *  data buffer
 */
#define LP_REG_BUF0    0xFFFFFFFFU
#define LP_REG_BUF0_M  (LP_REG_BUF0_V << LP_REG_BUF0_S)
#define LP_REG_BUF0_V  0xFFFFFFFFU
#define LP_REG_BUF0_S  0

/** LP_SPI_W1_REG register
 *  SPI CPU-controlled buffer1
 */
#define LP_SPI_W1_REG (DR_REG_LP_BASE + 0x9c)
/** LP_REG_BUF1 : R/W/SS; bitpos: [31:0]; default: 0;
 *  data buffer
 */
#define LP_REG_BUF1    0xFFFFFFFFU
#define LP_REG_BUF1_M  (LP_REG_BUF1_V << LP_REG_BUF1_S)
#define LP_REG_BUF1_V  0xFFFFFFFFU
#define LP_REG_BUF1_S  0

/** LP_SPI_W2_REG register
 *  SPI CPU-controlled buffer2
 */
#define LP_SPI_W2_REG (DR_REG_LP_BASE + 0xa0)
/** LP_REG_BUF2 : R/W/SS; bitpos: [31:0]; default: 0;
 *  data buffer
 */
#define LP_REG_BUF2    0xFFFFFFFFU
#define LP_REG_BUF2_M  (LP_REG_BUF2_V << LP_REG_BUF2_S)
#define LP_REG_BUF2_V  0xFFFFFFFFU
#define LP_REG_BUF2_S  0

/** LP_SPI_W3_REG register
 *  SPI CPU-controlled buffer3
 */
#define LP_SPI_W3_REG (DR_REG_LP_BASE + 0xa4)
/** LP_REG_BUF3 : R/W/SS; bitpos: [31:0]; default: 0;
 *  data buffer
 */
#define LP_REG_BUF3    0xFFFFFFFFU
#define LP_REG_BUF3_M  (LP_REG_BUF3_V << LP_REG_BUF3_S)
#define LP_REG_BUF3_V  0xFFFFFFFFU
#define LP_REG_BUF3_S  0

/** LP_SPI_W4_REG register
 *  SPI CPU-controlled buffer4
 */
#define LP_SPI_W4_REG (DR_REG_LP_BASE + 0xa8)
/** LP_REG_BUF4 : R/W/SS; bitpos: [31:0]; default: 0;
 *  data buffer
 */
#define LP_REG_BUF4    0xFFFFFFFFU
#define LP_REG_BUF4_M  (LP_REG_BUF4_V << LP_REG_BUF4_S)
#define LP_REG_BUF4_V  0xFFFFFFFFU
#define LP_REG_BUF4_S  0

