espressif/esp-idf/components/soc/esp32p4/register/hw_ver3/soc/lp_spi_reg.h
/** LP_SPI_W5_REG register
 *  SPI CPU-controlled buffer5
 */
#define LP_SPI_W5_REG (DR_REG_LP_BASE + 0xac)
/** LP_REG_BUF5 : R/W/SS; bitpos: [31:0]; default: 0;
 *  data buffer
 */
#define LP_REG_BUF5    0xFFFFFFFFU
#define LP_REG_BUF5_M  (LP_REG_BUF5_V << LP_REG_BUF5_S)
#define LP_REG_BUF5_V  0xFFFFFFFFU
#define LP_REG_BUF5_S  0

/** LP_SPI_W6_REG register
 *  SPI CPU-controlled buffer6
 */
#define LP_SPI_W6_REG (DR_REG_LP_BASE + 0xb0)
/** LP_REG_BUF6 : R/W/SS; bitpos: [31:0]; default: 0;
 *  data buffer
 */
#define LP_REG_BUF6    0xFFFFFFFFU
#define LP_REG_BUF6_M  (LP_REG_BUF6_V << LP_REG_BUF6_S)
#define LP_REG_BUF6_V  0xFFFFFFFFU
#define LP_REG_BUF6_S  0

/** LP_SPI_W7_REG register
 *  SPI CPU-controlled buffer7
 */
#define LP_SPI_W7_REG (DR_REG_LP_BASE + 0xb4)
/** LP_REG_BUF7 : R/W/SS; bitpos: [31:0]; default: 0;
 *  data buffer
 */
#define LP_REG_BUF7    0xFFFFFFFFU
#define LP_REG_BUF7_M  (LP_REG_BUF7_V << LP_REG_BUF7_S)
#define LP_REG_BUF7_V  0xFFFFFFFFU
#define LP_REG_BUF7_S  0

/** LP_SPI_W8_REG register
 *  SPI CPU-controlled buffer8
 */
#define LP_SPI_W8_REG (DR_REG_LP_BASE + 0xb8)
/** LP_REG_BUF8 : R/W/SS; bitpos: [31:0]; default: 0;
 *  data buffer
 */
#define LP_REG_BUF8    0xFFFFFFFFU
#define LP_REG_BUF8_M  (LP_REG_BUF8_V << LP_REG_BUF8_S)
#define LP_REG_BUF8_V  0xFFFFFFFFU
#define LP_REG_BUF8_S  0

/** LP_SPI_W9_REG register
 *  SPI CPU-controlled buffer9
 */
#define LP_SPI_W9_REG (DR_REG_LP_BASE + 0xbc)
/** LP_REG_BUF9 : R/W/SS; bitpos: [31:0]; default: 0;
 *  data buffer
 */
#define LP_REG_BUF9    0xFFFFFFFFU
#define LP_REG_BUF9_M  (LP_REG_BUF9_V << LP_REG_BUF9_S)
#define LP_REG_BUF9_V  0xFFFFFFFFU
#define LP_REG_BUF9_S  0

/** LP_SPI_W10_REG register
 *  SPI CPU-controlled buffer10
 */
#define LP_SPI_W10_REG (DR_REG_LP_BASE + 0xc0)
/** LP_REG_BUF10 : R/W/SS; bitpos: [31:0]; default: 0;
 *  data buffer
 */
#define LP_REG_BUF10    0xFFFFFFFFU
#define LP_REG_BUF10_M  (LP_REG_BUF10_V << LP_REG_BUF10_S)
#define LP_REG_BUF10_V  0xFFFFFFFFU
#define LP_REG_BUF10_S  0

/** LP_SPI_W11_REG register
 *  SPI CPU-controlled buffer11
 */
#define LP_SPI_W11_REG (DR_REG_LP_BASE + 0xc4)
/** LP_REG_BUF11 : R/W/SS; bitpos: [31:0]; default: 0;
 *  data buffer
 */
#define LP_REG_BUF11    0xFFFFFFFFU
#define LP_REG_BUF11_M  (LP_REG_BUF11_V << LP_REG_BUF11_S)
#define LP_REG_BUF11_V  0xFFFFFFFFU
#define LP_REG_BUF11_S  0

/** LP_SPI_W12_REG register
 *  SPI CPU-controlled buffer12
 */
#define LP_SPI_W12_REG (DR_REG_LP_BASE + 0xc8)
/** LP_REG_BUF12 : R/W/SS; bitpos: [31:0]; default: 0;
 *  data buffer
 */
#define LP_REG_BUF12    0xFFFFFFFFU
#define LP_REG_BUF12_M  (LP_REG_BUF12_V << LP_REG_BUF12_S)
#define LP_REG_BUF12_V  0xFFFFFFFFU
#define LP_REG_BUF12_S  0

/** LP_SPI_W13_REG register
 *  SPI CPU-controlled buffer13
 */
#define LP_SPI_W13_REG (DR_REG_LP_BASE + 0xcc)
/** LP_REG_BUF13 : R/W/SS; bitpos: [31:0]; default: 0;
 *  data buffer
 */
#define LP_REG_BUF13    0xFFFFFFFFU
#define LP_REG_BUF13_M  (LP_REG_BUF13_V << LP_REG_BUF13_S)
#define LP_REG_BUF13_V  0xFFFFFFFFU
#define LP_REG_BUF13_S  0

/** LP_SPI_W14_REG register
 *  SPI CPU-controlled buffer14
 */
#define LP_SPI_W14_REG (DR_REG_LP_BASE + 0xd0)
/** LP_REG_BUF14 : R/W/SS; bitpos: [31:0]; default: 0;
 *  data buffer
 */
#define LP_REG_BUF14    0xFFFFFFFFU
#define LP_REG_BUF14_M  (LP_REG_BUF14_V << LP_REG_BUF14_S)
#define LP_REG_BUF14_V  0xFFFFFFFFU
#define LP_REG_BUF14_S  0

/** LP_SPI_W15_REG register
 *  SPI CPU-controlled buffer15
 */
#define LP_SPI_W15_REG (DR_REG_LP_BASE + 0xd4)
/** LP_REG_BUF15 : R/W/SS; bitpos: [31:0]; default: 0;
 *  data buffer
 */
#define LP_REG_BUF15    0xFFFFFFFFU
#define LP_REG_BUF15_M  (LP_REG_BUF15_V << LP_REG_BUF15_S)
#define LP_REG_BUF15_V  0xFFFFFFFFU
#define LP_REG_BUF15_S  0

/** LP_SPI_SLAVE_REG register
 *  SPI slave control register
 */
#define LP_SPI_SLAVE_REG (DR_REG_LP_BASE + 0xe0)
/** LP_REG_CLK_MODE : R/W; bitpos: [1:0]; default: 0;
 *  SPI clock mode bits. 0: SPI clock is off when CS inactive 1: SPI clock is delayed
 *  one cycle after CS inactive 2: SPI clock is delayed two cycles after CS inactive 3:
 *  SPI clock is always on. Can be configured in CONF state.
 */
#define LP_REG_CLK_MODE    0x00000003U
#define LP_REG_CLK_MODE_M  (LP_REG_CLK_MODE_V << LP_REG_CLK_MODE_S)
#define LP_REG_CLK_MODE_V  0x00000003U
#define LP_REG_CLK_MODE_S  0
/** LP_REG_CLK_MODE_13 : R/W; bitpos: [2]; default: 0;
 *  {CPOL, CPHA},1: support spi clk mode 1 and 3, first edge output data B[0]/B[7].  0:
 *  support spi clk mode 0 and 2, first edge output data B[1]/B[6].
 */
#define LP_REG_CLK_MODE_13    (BIT(2))
#define LP_REG_CLK_MODE_13_M  (LP_REG_CLK_MODE_13_V << LP_REG_CLK_MODE_13_S)
#define LP_REG_CLK_MODE_13_V  0x00000001U
#define LP_REG_CLK_MODE_13_S  2
/** LP_REG_RSCK_DATA_OUT : R/W; bitpos: [3]; default: 0;
 *  It saves half a cycle when tsck is the same as rsck. 1: output data at rsck posedge
 *  0: output data at tsck posedge
 */
#define LP_REG_RSCK_DATA_OUT    (BIT(3))
#define LP_REG_RSCK_DATA_OUT_M  (LP_REG_RSCK_DATA_OUT_V << LP_REG_RSCK_DATA_OUT_S)
#define LP_REG_RSCK_DATA_OUT_V  0x00000001U
#define LP_REG_RSCK_DATA_OUT_S  3
/** LP_REG_SLV_RDBUF_BITLEN_EN : R/W; bitpos: [10]; default: 0;
 *  1: SPI_SLV_DATA_BITLEN stores data bit length of master-read-slave data length in
 *  CPU controlled mode(Rd_BUF). 0: others
 */
#define LP_REG_SLV_RDBUF_BITLEN_EN    (BIT(10))
#define LP_REG_SLV_RDBUF_BITLEN_EN_M  (LP_REG_SLV_RDBUF_BITLEN_EN_V << LP_REG_SLV_RDBUF_BITLEN_EN_S)
#define LP_REG_SLV_RDBUF_BITLEN_EN_V  0x00000001U
#define LP_REG_SLV_RDBUF_BITLEN_EN_S  10
/** LP_REG_SLV_WRBUF_BITLEN_EN : R/W; bitpos: [11]; default: 0;
 *  1: SPI_SLV_DATA_BITLEN stores data bit length of master-write-to-slave data length
 *  in CPU controlled mode(Wr_BUF). 0: others
 */
#define LP_REG_SLV_WRBUF_BITLEN_EN    (BIT(11))
#define LP_REG_SLV_WRBUF_BITLEN_EN_M  (LP_REG_SLV_WRBUF_BITLEN_EN_V << LP_REG_SLV_WRBUF_BITLEN_EN_S)
#define LP_REG_SLV_WRBUF_BITLEN_EN_V  0x00000001U
#define LP_REG_SLV_WRBUF_BITLEN_EN_S  11
/** LP_REG_SLAVE_MODE : R/W; bitpos: [26]; default: 0;
 *  Set SPI work mode. 1: slave mode 0: master mode.
 */
#define LP_REG_SLAVE_MODE    (BIT(26))
#define LP_REG_SLAVE_MODE_M  (LP_REG_SLAVE_MODE_V << LP_REG_SLAVE_MODE_S)
#define LP_REG_SLAVE_MODE_V  0x00000001U
#define LP_REG_SLAVE_MODE_S  26
/** LP_REG_SOFT_RESET : WT; bitpos: [27]; default: 0;
 *  Software reset enable, reset the spi clock line cs line and data lines. Can be
 *  configured in CONF state.
 */
#define LP_REG_SOFT_RESET    (BIT(27))
#define LP_REG_SOFT_RESET_M  (LP_REG_SOFT_RESET_V << LP_REG_SOFT_RESET_S)
#define LP_REG_SOFT_RESET_V  0x00000001U
#define LP_REG_SOFT_RESET_S  27

/** LP_SPI_SLAVE1_REG register
 *  SPI slave control register 1
 */
#define LP_SPI_SLAVE1_REG (DR_REG_LP_BASE + 0xe4)
/** LP_REG_SLV_DATA_BITLEN : R/W/SS; bitpos: [17:0]; default: 0;
 *  The transferred data bit length in SPI slave FD and HD mode.
 */
#define LP_REG_SLV_DATA_BITLEN    0x0003FFFFU
#define LP_REG_SLV_DATA_BITLEN_M  (LP_REG_SLV_DATA_BITLEN_V << LP_REG_SLV_DATA_BITLEN_S)
#define LP_REG_SLV_DATA_BITLEN_V  0x0003FFFFU
#define LP_REG_SLV_DATA_BITLEN_S  0
/** LP_REG_SLV_LAST_COMMAND : R/W/SS; bitpos: [25:18]; default: 0;
 *  In the slave mode it is the value of command.
 */
#define LP_REG_SLV_LAST_COMMAND    0x000000FFU
#define LP_REG_SLV_LAST_COMMAND_M  (LP_REG_SLV_LAST_COMMAND_V << LP_REG_SLV_LAST_COMMAND_S)
#define LP_REG_SLV_LAST_COMMAND_V  0x000000FFU
#define LP_REG_SLV_LAST_COMMAND_S  18
/** LP_REG_SLV_LAST_ADDR : R/W/SS; bitpos: [31:26]; default: 0;
 *  In the slave mode it is the value of address.
 */
#define LP_REG_SLV_LAST_ADDR    0x0000003FU
#define LP_REG_SLV_LAST_ADDR_M  (LP_REG_SLV_LAST_ADDR_V << LP_REG_SLV_LAST_ADDR_S)
#define LP_REG_SLV_LAST_ADDR_V  0x0000003FU
#define LP_REG_SLV_LAST_ADDR_S  26

/** LP_SPI_CLK_GATE_REG register
 *  SPI module clock and register clock control
 */
#define LP_SPI_CLK_GATE_REG (DR_REG_LP_BASE + 0xe8)
/** LP_REG_CLK_EN : R/W; bitpos: [0]; default: 0;
 *  Set this bit to enable clk gate
 */
#define LP_REG_CLK_EN    (BIT(0))
#define LP_REG_CLK_EN_M  (LP_REG_CLK_EN_V << LP_REG_CLK_EN_S)
#define LP_REG_CLK_EN_V  0x00000001U
#define LP_REG_CLK_EN_S  0
/** LP_REG_MST_CLK_ACTIVE : R/W; bitpos: [1]; default: 0;
 *  Set this bit to power on the SPI module clock.
 */
#define LP_REG_MST_CLK_ACTIVE    (BIT(1))
#define LP_REG_MST_CLK_ACTIVE_M  (LP_REG_MST_CLK_ACTIVE_V << LP_REG_MST_CLK_ACTIVE_S)
#define LP_REG_MST_CLK_ACTIVE_V  0x00000001U
#define LP_REG_MST_CLK_ACTIVE_S  1
/** LP_REG_MST_CLK_SEL : R/W; bitpos: [2]; default: 0;
 *  This bit is used to select SPI module clock source in master mode. 1: PLL_CLK_80M.
 *  0: XTAL CLK.
 */
#define LP_REG_MST_CLK_SEL    (BIT(2))
#define LP_REG_MST_CLK_SEL_M  (LP_REG_MST_CLK_SEL_V << LP_REG_MST_CLK_SEL_S)
#define LP_REG_MST_CLK_SEL_V  0x00000001U
#define LP_REG_MST_CLK_SEL_S  2

