espressif/esp-idf/components/soc/esp32p4/register/hw_ver3/soc/lp_spi_reg.h
/** LP_SPI_DATE_REG register
 *  Version control
 */
#define LP_SPI_DATE_REG (DR_REG_LP_BASE + 0xf0)
/** LP_REG_DATE : R/W; bitpos: [27:0]; default: 33591360;
 *  SPI register version.
 */
#define LP_REG_DATE    0x0FFFFFFFU
#define LP_REG_DATE_M  (LP_REG_DATE_V << LP_REG_DATE_S)
#define LP_REG_DATE_V  0x0FFFFFFFU
#define LP_REG_DATE_S  0

/** LP_RND_ECO_CS_REG register
 *  NA
 */
#define LP_RND_ECO_CS_REG (DR_REG_LP_BASE + 0xf4)
/** LP_REG_RND_ECO_EN : R/W; bitpos: [0]; default: 0;
 *  NA
 */
#define LP_REG_RND_ECO_EN    (BIT(0))
#define LP_REG_RND_ECO_EN_M  (LP_REG_RND_ECO_EN_V << LP_REG_RND_ECO_EN_S)
#define LP_REG_RND_ECO_EN_V  0x00000001U
#define LP_REG_RND_ECO_EN_S  0
/** LP_RND_ECO_RESULT : RO; bitpos: [1]; default: 0;
 *  NA
 */
#define LP_RND_ECO_RESULT    (BIT(1))
#define LP_RND_ECO_RESULT_M  (LP_RND_ECO_RESULT_V << LP_RND_ECO_RESULT_S)
#define LP_RND_ECO_RESULT_V  0x00000001U
#define LP_RND_ECO_RESULT_S  1

/** LP_RND_ECO_LOW_REG register
 *  NA
 */
#define LP_RND_ECO_LOW_REG (DR_REG_LP_BASE + 0xf8)
/** LP_REG_RND_ECO_LOW : R/W; bitpos: [31:0]; default: 0;
 *  NA
 */
#define LP_REG_RND_ECO_LOW    0xFFFFFFFFU
#define LP_REG_RND_ECO_LOW_M  (LP_REG_RND_ECO_LOW_V << LP_REG_RND_ECO_LOW_S)
#define LP_REG_RND_ECO_LOW_V  0xFFFFFFFFU
#define LP_REG_RND_ECO_LOW_S  0

/** LP_RND_ECO_HIGH_REG register
 *  NA
 */
#define LP_RND_ECO_HIGH_REG (DR_REG_LP_BASE + 0xfc)
/** LP_REG_RND_ECO_HIGH : R/W; bitpos: [31:0]; default: 65535;
 *  NA
 */
#define LP_REG_RND_ECO_HIGH    0xFFFFFFFFU
#define LP_REG_RND_ECO_HIGH_M  (LP_REG_RND_ECO_HIGH_V << LP_REG_RND_ECO_HIGH_S)
#define LP_REG_RND_ECO_HIGH_V  0xFFFFFFFFU
#define LP_REG_RND_ECO_HIGH_S  0

#ifdef __cplusplus
}
#endif
